app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `user` = 'e2e2'
 LIMIT 1
---
    public function login()
    {
        $user = $this->request->getPost('user');
        $password = $this->request->getPost('password');

        $usersData = $this->LoginModels->where('user', $user)->first();